import DepartmentImage1 from '@/../public/departmens/department_1.webp'
import DepartmentImage2 from '@/../public/departmens/department_2.webp'
import DepartmentImage3 from '@/../public/departmens/department_3.webp'
import DepartmentImage4 from '@/../public/departmens/department_4.webp'
import DepartmentImage5 from '@/../public/departmens/department_5.webp'
import DepartmentImage6 from '@/../public/departmens/department_6.webp'
import DepartmentImage7 from '@/../public/departmens/department_7.webp'

export const hardcodeDepartments = [
    {
        badge: 'IТ-город',
        id: 1,
        title: 'Создавай цифровые решения',
        description: 'Развивай ИТ-решения столицы и помогай делать жизнь миллионов горожан комфортнее и удобнее. На стажировке в ДИТ ты узнаешь, как Москва использует технологии искусственного интеллекта и блокчейн, научишься кодить со скоростью света и управлять ИТ-проектами, определишься с будущей специальностью и даже внесешь свой вклад в развитие цифровой экосистемы города.',
        department: 'Департамене информационных технологий города Москвы',
        name: 'Татьяна Коломиец',
        jobTitle: 'Начальник сектора стажировок Центра развития карьеры Правительства Москвы',
        img: DepartmentImage1
    },
    {
        badge: 'HR-город',
        id: 2,
        title: 'Собирай команду супергероев',
        description: 'Публикуй вакансии и организовывай собеседования, чтобы найти лучших из лучших для работы в команде Москвы. А еще ты будешь помогать в организации программ адаптации, обучения и развития госслужащих, создавать профсообщества и собирать данные для принятия важных кадровых решений.',
        department: 'Аппарат Мэра и Правительства Москвы, HR-отделы органов власти Москвы, Университет Правительства Москвы, Департамент труда и социальной защиты населения, АНО «Развитие человеческого капитала», Центр развития «Среда возможностей»',
        name: 'Нина Филимонова',
        jobTitle: 'Директор Центра развития карьеры, руководитель Молодежных карьерных проектов, куратор «HR-города»',
        img: DepartmentImage7
    },
    {
        badge: 'Медийный город',
        id: 3,
        title: 'Продвигай столичные проекты',
        description: 'Стажеры-пиарщики пишут пресс-релизы, статьи и комментарии для СМИ, создают презентации, учатся брать интервью и ведут социальные сети органов власти, принимают участие в организации городских мероприятий.',
        department: 'Департамент средств массовой информации, Агентство инноваций Москвы, Выставка достижений народного хозяйства, Московское кино, Пиар-отделы органов власти',
        name: 'Лиана Ширшова',
        jobTitle: 'Менеджер по трудоустройству выпускников стажировки, куратор «Медийного города»',
        img: DepartmentImage3
    },
    {
        badge: 'Городская экономика',
        id: 4,
        title: 'Составляй бюджеты главных проектов',
        description: 'Узнай, как устроена экономика Москвы. Тебя ждет работа с закупками, подготовка документации по предоставлению мер поддержки предпринимателям, сбор, обработка и анализ показателей социально-экономического развития города и много цифр!',
        department: 'Главное контрольное управление, Департамент финансов города Москвы, Департамент инвестиционной и промышленной политики, Особая экономическая зона «Технополис «Москва», Экономические отделы органов власти Москвы',
        name: 'Мария Пережогина',
        jobTitle: 'Финансовый менеджер молодежных карьерных проектов Правительства Москвы, куратор «Городской экономики»',
        img: DepartmentImage4
    },
    {
        badge: 'Социальный город',
        id: 5,
        title: 'Помогай жителям и гостям столицы',
        description: 'В этом направлении тебе предстоит организовывать городские мероприятия, взаимодействовать с молодежью и совершенствовать меры социальной поддержки жителей. Также стажеры учатся работать с муниципальными документами и грамотно оформлять отчеты.',
        department: 'Департамент здравоохранения, Департамент образования, Департамент труда и социальной защиты населения, Агентство общественных проектов, «Моя карьера»',
        name: 'Ольга Твердохвалова',
        jobTitle: 'Менеджер по взаимодействию со школами и вузами, куратор «Социального города»',
        img: DepartmentImage5
    },
    {
        badge: 'Комфортная городская среда',
        id: 6,
        title: 'Создавай удобство для каждого',
        description: 'Участвуй в проектах по благоустройству Москвы: от установки лавочек до важных решений по охране окружающей среды. Ты научишься инспектировать объекты городской инфраструктуры и узнаешь, как оперативно реагировать на сообщения жителей.',
        department: 'Московская административная дорожная инспекция, Департамент городского имущества, Комитет по архитектуре и градостроительству, Государственная инспекция по контролю за использованием объектов недвижимости',
        name: 'Кристина Волкова',
        jobTitle: 'Менеджер по взаимодействию с органами власти, куратор «Комфортной городской среды»',
        img: DepartmentImage6
    },
    {
        badge: 'Правовое пространство',
        id: 7,
        title: 'Создавай правовую основу',
        description: 'Помогай соблюдать права и обязанности жителей и гостей города. В твои задачи будет входить подготовка нормативно-правовых актов, справок и проектов официальных писем, ответов на обращения жителей, мониторинг и анализ судебной практики, а также участие в судебных заседаниях.',
        department: 'Правовое управление Правительства Москвы, Департамент предпринимательства и инновационного развития, Департамент городского имущества, Аналитический центр контрольной деятельности, Юридические отделы органов власти Москвы',
        name: 'Арина Гулямова',
        jobTitle: 'Менеджер профессионального сообщества выпускников стажировки, куратор «Правового пространства»',
        img: DepartmentImage2
    },
];

export const hardcodeDepartmentsBadges: { id: number, badge: string }[] = hardcodeDepartments.reduce((acc, cur) => {
    acc.push({ id: cur.id, badge: cur.badge })
    return acc
}, [])
